docs: represent DDD Modular Monolith diagram as ASCII
